# CannotFindAreaScheme Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures..::..CannotFindAreaScheme Property
BuiltInFailures..::..CurveFailures Class See Also
---
Can't find new Area Scheme for Area Boundary.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotFindAreaScheme { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotFindAreaScheme As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotFindAreaScheme {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveFailures Class
Autodesk.Revit.DB Namespace